Repository: al-mahir/iOS
Catalog: Modules/Mushaf/Sources/Mushaf/Resources/Localizable.xcstrings
Source language: en
Languages: ar

source: %d Ayahs
ar: %d آية

source: %lld Ayahs
ar: %lld آية

source: 2 Counts
ar: حركتان

source: 2, 4, or 6 Counts
ar: 2 أو 4 أو 6 حرَكات

source: 4 - 5 Counts
ar: 4 - 5 حرَكات

source: 6 Counts
ar: 6 حرَكات

source: Cancel
ar: إلغاء

source: Clear
ar: مسح

source: Connecting…
ar: جاري الاتصال…

source: Couldn't load bookmarks: %@
ar: تعذر تحميل العلامات المرجعية: %@

source: Couldn't update bookmark: %@
ar: تعذر تحديث العلامة المرجعية: %@

source: Echoing sound of sukoon
ar: إخراج الصوت بنبرة قوية عند السكون

source: Enter a valid number.
ar: يرجى إدخال رقم صحيح.

# Failed to load page %d: %@
source: Failed to load page %1$d: %2$@
ar: فشل تحميل الصفحة %1$d: %2$@

source: Ghunnah
ar: الغنة

source: Go
ar: انتقال

source: Go to
ar: الانتقال إلى

source: Go to Page
ar: الانتقال إلى صفحة

source: Got it!
ar: فهمت!

source: Heavy pronunciation
ar: تغليظ حرف النطق

source: Juz'
ar: جزء

source: Juz' %d
ar: الجزء %d

source: Juz' %lld
ar: الجزء %lld

source: Listening
ar: استماع

source: Loading fonts…
ar: جاري تحميل الخطوط…

source: Mandatory Madd (4-5)
ar: مد واجب (4-5)

source: Muallem
ar: معلم

source: Next
ar: التالي

source: No mistakes yet
ar: لا توجد أخطاء حتى الآن

source: Normal Madd (2)
ar: مد طبيعي (2)

source: Nun and Meem Mushaddad
ar: النون والميم المشددتان

source: Obligatory Madd (6)
ar: مد لازم (6)

# onboarding.tooltip.step
source: Step %1$d of %2$d
ar: الخطوة %1$d من %2$d

source: Page
ar: صفحة

source: Page %d
ar: الصفحة %d

source: Page %lld
ar: الصفحة %lld

# Page %lld • Juz %lld
source: Page %1$lld • Juz %2$lld
ar: الصفحة %1$lld • الجزء %2$lld

source: Page must be between 1 and %d.
ar: يجب أن يكون رقم الصفحة بين 1 و %d.

source: Page number (1–%d)
ar: رقم الصفحة (1–%d)

source: Page number (1–%lld)
ar: رقم الصفحة (1–%lld)

source: Permissible Madd (2/4/6)
ar: مد جائز (2/4/6)

source: Qalqalah
ar: قلقلة

source: Reading
ar: قراءة

source: Real-time mistake detection
ar: كشف الأخطاء أثناء التلاوة

source: Recitation
ar: تسميع

source: Recitation Errors
ar: أخطاء التلاوة

source: Recite
ar: رتّل

source: Search surah
ar: بحث عن سورة

source: Sheikh recites, then you repeat
ar: الشيخ يقرأ ثم تكرر خلفه

source: Show tajweed color legend
ar: عرض دليل ألوان التجويد

source: Silent Letters
ar: حروف تكتب ولا تلفظ

source: Silent, self-paced reading
ar: قراءة صامتة حسب سرعتك

source: Stop
ar: إيقاف

source: Surah
ar: سورة

source: Tafkhim
ar: تفخيم

source: Tajweed Color Guide
ar: دليل ألوان التجويد

source: Tajweed Rules
ar: أحكام التجويد

source: Tajweed Tarteel Color System
ar: نظام ألوان تجويد الترتيل

source: Tap and hold any verse to display its Tafseer (explanation).
ar: اضغط مع الاستمرار على أي آية لعرض تفسيرها.

source: Tap here to browse all 114 Surahs.
ar: اضغط هنا لتصفح جميع السور الـ 114.

source: Tap mic to recite — AI Tajweed correction
ar: اضغط على الميكروفون للترتيل — تصحيح التجويد بالذكاء الاصطناعي

source: Teacher
ar: معلم

source: Text hidden
ar: النص مخفي

source: Use Listening mode to listen to recitations.
ar: استخدم وضع الاستماع للاستماع إلى التلاوات.

source: Use Reading mode to display the traditional Mushaf layout.
ar: استخدم وضع القراءة لعرض المصحف بالشكل التقليدي.

source: Use Recitation mode to get live AI corrections on your recitation.
ar: استخدم وضع التسميع للحصول على تصحيح فوري بقوة الذكاء الاصطناعي.

source: Use Teacher mode to repeat after the Sheikh.
ar: استخدم وضع المعلم للتكرار خلف الشيخ.

source: View color-coded tajweed definitions
ar: عرض تعاريف التجويد الملونة

source: View color-coded tajweed definitions.
ar: عرض تعاريف أحكام التجويد الملونة.

source: Word-by-word sync playback
ar: تشغيل متزامن كلمة بكلمة

source: Written but not spoken
ar: تكتب ولا تلفظ
